Masmiseim36/iMXRT/targets/iMXRT/Loader2/libmem_driver_FlexSPI.cpp
/** Loader for iMXRT-Family
Copyright (C) 2019-2026 Markus Klein
https://github.com/Masmiseim36/iMXRT

Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

1. Redistributions of source code must retain the above copyright notice,
   this list of conditions and the following disclaimer.

THIS SOFTWARE IS PROVIDED BY THE AUTHOR "AS IS" AND ANY EXPRESS OR IMPLIED
WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF
MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT
SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT
OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING
IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE. */


#include "libmem_driver_FlexSPI.h"
#include "libmem_Tools.h"
#include "fsl_device_registers.h"
#include "fsl_flexspi.h"
#include "fsl_common.h"
#include "fsl_clock.h"
#if __has_include("fsl_power.h")
	#include "fsl_power.h"
#endif
#include "DebugPrint.h"

#include "FlexSPI_Generic.h"
#include "FlexSPI_Adesto.h"
#include "FlexSPI_Macronix.h"
#include "FlexSPI_Winbond.h"
#include "FlexSPI_ISSI.h"
#include "FlexSPI_Spansion.h"
#include "FlexSPI_Micron.h"

namespace Xspi
{
	static const flexspi_device_config_t Deviceconfig
	{
		.flexspiRootClk       = 0, // SPI root clock (will be set up later)
		.isSck2Enabled        = false,
		.flashSize            = 1024 * 8, // expressed in KByte, set a dummy value for now, will be changed after read the JEDEC information. This is necessarry for reading the JEDEC information
		#if defined(FSL_FEATURE_FLEXSPI_SUPPORT_ADDRESS_SHIFT) && (FSL_FEATURE_FLEXSPI_SUPPORT_ADDRESS_SHIFT)
			.addressShift     = 0,
		#endif
		.CSIntervalUnit       = kFLEXSPI_CsIntervalUnit1SckCycle,
		.CSInterval           = 2,
		.CSHoldTime           = 3,
		.CSSetupTime          = 3,
		.dataValidTime        = 2,
		.columnspace          = 0, // we don't use columns
		.enableWordAddress    = false,
		.AWRSeqIndex          = 0, // LUT_ProgramPage,
		.AWRSeqNumber         = 0, // 1
		.ARDSeqIndex          = LUT_ReadArray,
		.ARDSeqNumber         = 1,
		.AHBWriteWaitUnit     = kFLEXSPI_AhbWriteWaitUnit2AhbCycle,
		.AHBWriteWaitInterval = 0,
		.enableWriteMask      = false,
		#if defined(FSL_FEATURE_FLEXSPI_HAS_ERRATA_051426) && (FSL_FEATURE_FLEXSPI_HAS_ERRATA_051426)
			.isFroClockSource = false //!<  \brief Is FRO clock source or not.
		#endif
	};


	static const flexspi_device_config_t Deviceconfig_Hyperram
	{
		.flexspiRootClk       = 0, // SPI root clock (will be set up later)
		.isSck2Enabled        = false,
		.flashSize            = 1024 * 8, // expressed in KByte, set a dummy value for now, will be changed after read the JEDEC information. This is necessarry for reading the JEDEC information
		#if defined(FSL_FEATURE_FLEXSPI_SUPPORT_ADDRESS_SHIFT) && (FSL_FEATURE_FLEXSPI_SUPPORT_ADDRESS_SHIFT)
			.addressShift     = 0,
		#endif
		.CSIntervalUnit       = kFLEXSPI_CsIntervalUnit1SckCycle,
		.CSInterval           = 0,
		.CSHoldTime           = 3,
		.CSSetupTime          = 3,
		.dataValidTime        = 2, // DLLCR_OVRDVAL und sollte 0 sein
		.columnspace          = 3,
		.enableWordAddress    = true,
		.AWRSeqIndex          = 9,
		.AWRSeqNumber         = 1,
		.ARDSeqIndex          = 0,
		.ARDSeqNumber         = 1,
		.AHBWriteWaitUnit     = kFLEXSPI_AhbWriteWaitUnit2AhbCycle,
		.AHBWriteWaitInterval = 0,
		.enableWriteMask      = true,
		#if defined(FSL_FEATURE_FLEXSPI_HAS_ERRATA_051426) && (FSL_FEATURE_FLEXSPI_HAS_ERRATA_051426)
			.isFroClockSource = false //!<  \brief Is FRO clock source or not.
		#endif
	};


	namespace
	{
		status_t EraseChip     (FlexSPI_Helper *base);
		int EraseSector        (libmem_driver_handle_t *h, libmem_sector_info_t *si);
		int ProgramPage        (libmem_driver_handle_t *h, uint8_t *destination, const uint8_t *source);
		int libmem_ProgramPage (libmem_driver_handle_t *h, uint8_t *dest, const uint8_t *src, size_t size);
		int libmem_EraseSector (libmem_driver_handle_t *h, uint8_t *start, size_t size, uint8_t **erase_start, size_t *erase_size);
		int libmem_Flush       (libmem_driver_handle_t *h);
		int libmem_Read        (libmem_driver_handle_t *h, uint8_t *dest, const uint8_t *src, size_t size);
		uint32_t libmem_CRC32  (libmem_driver_handle_t *h, const uint8_t *start, size_t size, uint32_t crc);
	}


	static const libmem_driver_functions_t DriverFunctions
	{
		libmem_ProgramPage,
		nullptr,
		libmem_EraseSector,
		nullptr,
		nullptr,
		libmem_Flush
	};

	static const libmem_ext_driver_functions_t DriverFunctions_Extended
	{
		nullptr,
		libmem_Read,
		libmem_CRC32
	};
}

namespace Hyperflash
{
	static const flexspi_device_config_t Deviceconfig
	{
		.flexspiRootClk       = 0, // SPI root clock (will be set up later)
		.isSck2Enabled        = false,
		.flashSize            = 0x4000000 / 1024,	// Size in KBytes
		#if defined(FSL_FEATURE_FLEXSPI_SUPPORT_ADDRESS_SHIFT) && (FSL_FEATURE_FLEXSPI_SUPPORT_ADDRESS_SHIFT)
			.addressShift     = 0,
		#endif
		.CSIntervalUnit       = kFLEXSPI_CsIntervalUnit1SckCycle,
		.CSInterval           = 2,
		.CSHoldTime           = 0,
		.CSSetupTime          = 3,
		.dataValidTime        = 1,
		.columnspace          = 3,
		.enableWordAddress    = true,
		.AWRSeqIndex          = static_cast<uint8_t>(Spansion::Command::WriteData),
		.AWRSeqNumber         = 1,
		.ARDSeqIndex          = static_cast<uint8_t>(Spansion::Command::ReadData),
		.ARDSeqNumber         = 1,
		.AHBWriteWaitUnit     = kFLEXSPI_AhbWriteWaitUnit2AhbCycle,
		.AHBWriteWaitInterval = 20,
		.enableWriteMask      = false,
		#if defined(FSL_FEATURE_FLEXSPI_HAS_ERRATA_051426) && (FSL_FEATURE_FLEXSPI_HAS_ERRATA_051426)
			.isFroClockSource = false //!<  \brief Is FRO clock source or not.
		#endif
	};


	namespace
	{
		int WriteEnable    (FlexSPI_Helper *base, uint32_t baseAddr);
		status_t EraseChip (FlexSPI_Helper *base);

		int EraseSector        (libmem_driver_handle_t *h, libmem_sector_info_t *si);
		int ProgramPage        (libmem_driver_handle_t *h, uint8_t *destination, const uint8_t *source);
		int libmem_ProgramPage (libmem_driver_handle_t *h, uint8_t *dest, const uint8_t *src, size_t size);
		int libmem_EraseSector (libmem_driver_handle_t *h, uint8_t *start, size_t size, uint8_t **erase_start, size_t *erase_size);
		int libmem_Flush       (libmem_driver_handle_t *h);
		int libmem_Read        (libmem_driver_handle_t *h, uint8_t *dest, const uint8_t *src, size_t size);
		uint32_t libmem_CRC32  (libmem_driver_handle_t *h, const uint8_t *start, size_t size, uint32_t crc);
	}


