Masmiseim36/iMXRT/targets/iMXRT/Loader2/libmem_driver_FlexSPI.cpp
		geometry[0].size = 0x40000; // 256 KByte / 2MBit

		config.rxSampleClock = kFLEXSPI_ReadSampleClkExternalInputFromDqsPad; // To achieve high speeds - always use DQS
	}
	else if (memType == MemoryType::Hyperram)
	{
		base->UpdateLUT (Generic::LUT_Hyperram);
		info.Capacity      = static_cast<Capacity>(Capacity_256MBit);
		config.rxWatermark = 64;
		config.txWatermark = 0;
		config.enableDoze  = false;
		#if !(defined(FSL_FEATURE_FLEXSPI_HAS_NO_MCR0_COMBINATIONEN) && FSL_FEATURE_FLEXSPI_HAS_NO_MCR0_COMBINATIONEN)
		config.enableCombination = true;
		#endif
		config.rxSampleClock = kFLEXSPI_ReadSampleClkExternalInputFromDqsPad; // To achieve high speeds - always use DQS
	}
	else
	{
		// Get the JEDEC Informations
		static const std::array<status_t (*) (FlexSPI_Helper &, DeviceInfo &), 4> JedecReader
		{
			[](FlexSPI_Helper &b, DeviceInfo &i){return b.ReadJEDEC (&i);},
			Macronix::TryDetect,
			ISSI::TryDetect,
			Micron::TryDetect
		};
		for (auto reader : JedecReader)
		{
			status = reader (*base, info);
			if (status == kStatus_Success && info.ManufactureID != ManufactureID_UNDEF)
				break;
		}

		if (status != kStatus_Success || info.ManufactureID == ManufactureID_UNDEF)
		{
			DebugPrint ("JEDEC read Error\r\n");
			return LibmemStaus_InvalidDevice;
		}

		// Check for the Manufacture-ID and adapt the Configuration
		LibmemStatus_t res = LibmemStaus_Success;
		switch (info.ManufactureID)
		{
			case ManufactureID_AdestoTechnologies:
			case ManufactureID_Atmel:		// Renesas
				res = Adesto::Initialize (*base, memType, info, config, deviceconfig);
				break;
			case ManufactureID_Nexcom:		// Winbond
				res = Winbond::Initialize (*base, memType, info, config, deviceconfig);
				break;
			case ManufactureID_Macronix:	// Macronix
				res = Macronix::Initialize (*base, memType, info, config, deviceconfig);
				break;
			case ManufactureID_Lucent:		// ISSI
				res = ISSI::Initialize (*base, memType, info, config, deviceconfig);
				break;
			case ManufactureID_MicronTechnology:
				res = Micron::Initialize (*base, memType, info, config, deviceconfig);
				break;
			default:
				DebugPrint ("unknown Flash-memory\r\n");
				return LibmemStaus_InvalidDevice;
		}

		if (res != LibmemStaus_Success)
			return res;
	}

	// Reconfigure the interface according to the gathered flash information and configuration
	if (memType == MemoryType::OctaSPI_DDR || memType == MemoryType::QuadSPI_DDR || memType == MemoryType::Hyperflash || memType == MemoryType::Hyperram)
	{
		#if (defined(MIMXRT533S_SERIES)   || defined(MIMXRT555S_SERIES) || defined(MIMXRT595S_cm33_SERIES))
			clockDiv = 2;
			if (base == FLEXSPI0)
			{
				CLKCTL0->FLEXSPI0FCLKDIV = CLKCTL0_FLEXSPI0FCLKDIV_DIV (clockDiv - 1);
				while ((CLKCTL0->FLEXSPI0FCLKDIV) & CLKCTL0_FLEXSPI0FCLKDIV_REQFLAG_MASK)
					;
				deviceconfig.flexspiRootClk = CLOCK_GetFlexspiClkFreq (0);
			}
			else if (base == FLEXSPI1)
			{
				CLKCTL0->FLEXSPI1FCLKDIV = CLKCTL0_FLEXSPI1FCLKDIV_DIV (clockDiv - 1);
				while ((CLKCTL0->FLEXSPI1FCLKDIV) & CLKCTL0_FLEXSPI1FCLKDIV_REQFLAG_MASK)
					;
				deviceconfig.flexspiRootClk = CLOCK_GetFlexspiClkFreq (1);
			}
			else
				return LibmemStaus_Error;
			config.rxSampleClock = kFLEXSPI_ReadSampleClkLoopbackInternally; // No DQS
		#elif (defined(MIMXRT633S_SERIES) || defined(MIMXRT685S_cm33_SERIES))
			// No need to change the clock here.
			config.rxSampleClock = kFLEXSPI_ReadSampleClkLoopbackInternally; // No DQS
		#elif (defined(MIMXRT1011_SERIES) || defined(MIMXRT1015_SERIES) || defined(MIMXRT1021_SERIES) || defined(MIMXRT1024_SERIES) || \
			   defined(MIMXRT1041_SERIES) || defined(MIMXRT1042_SERIES) || defined(MIMXRT1051_SERIES) || defined(MIMXRT1052_SERIES) || \
			   defined(MIMXRT1061_SERIES) || defined(MIMXRT1062_SERIES) || defined(MIMXRT1064_SERIES))
			if (memType == MemoryType::Hyperflash)
				clockDiv = 7;	// With Hyperflash writing must be done with reduces speed (50 HMz max)
			else
				clockDiv = 2;
			CLOCK_SetDiv (FlexSPIDiv, clockDiv-1);	// flexspi clock divide by two --> 240 MHz.
			ClockHz = sourceClock_Hz / clockDiv;
			deviceconfig.flexspiRootClk = ClockHz;
		#elif (defined(MIMXRT1165_cm7_SERIES) || defined(MIMXRT1166_cm7_SERIES) || defined(MIMXRT1165_cm4_SERIES) || defined(MIMXRT1166_cm4_SERIES) || \
			   defined(MIMXRT1171_SERIES)     || defined(MIMXRT1172_SERIES)     || \
			   defined(MIMXRT1173_cm7_SERIES) || defined(MIMXRT1175_cm7_SERIES) || defined(MIMXRT1176_cm7_SERIES) || \
			   defined(MIMXRT1173_cm4_SERIES) || defined(MIMXRT1175_cm4_SERIES) || defined(MIMXRT1176_cm4_SERIES))
			CLOCK_ControlGate (FlexSPIClockGate, kCLOCK_Off);	// The module clock must be disabled during clock switch in order to avoid glitch
			CLOCK_SetRootClockMux (FlexSPIClock, 5); // ClockSource_SysPll2 --> 528 MHz
			CLOCK_SetRootClockDiv (FlexSPIClock, 2); // --> 528 MHz / 2 = ~264 MHz
			CLOCK_ControlGate (FlexSPIClockGate, kCLOCK_On);
			deviceconfig.flexspiRootClk = CLOCK_GetRootClockFreq (FlexSPIClock);
	#elif (defined(MIMXRT1181_SERIES)      || defined(MIMXRT1182_SERIES)     || defined(MIMXRT118C_cm33_SERIES) || defined(MIMXRT118C_cm7_SERIES) || \
		   defined(MIMXRT1185_cm33_SERIES) || defined(MIMXRT1185_cm7_SERIES) || defined(MIMXRT1186_cm33_SERIES) || defined(MIMXRT1186_cm7_SERIES) || \
		   defined(MIMXRT1187_cm33_SERIES) || defined(MIMXRT1187_cm7_SERIES) || defined(MIMXRT1189_cm33_SERIES) || defined(MIMXRT1189_cm7_SERIES))
			switch (reinterpret_cast<uint32_t>(base))
			{
				case FLEXSPI1_BASE:
					CLOCK_SetRootClockDiv (kCLOCK_Root_Flexspi1, 2); // --> 392,7s MHz / 2 = ~196,35 MHz
					CLOCK_SetRootClockMux (kCLOCK_Root_Flexspi1, kCLOCK_FLEXSPI1_ClockRoot_MuxSysPll3Pfd0); // ClockSource_SysPll2 --> 392,7s MHz
					ClockHz = CLOCK_GetRootClockFreq (kCLOCK_Root_Flexspi1);
					break;
				case FLEXSPI2_BASE:
					CLOCK_SetRootClockDiv (kCLOCK_Root_Flexspi2, 2); // --> 392,7s MHz / 2 = ~196,35 MHz
					CLOCK_SetRootClockMux (kCLOCK_Root_Flexspi2, kCLOCK_FLEXSPI2_ClockRoot_MuxSysPll3Pfd2); // ClockSource_SysPll2 --> 392,7s MHz
					ClockHz = CLOCK_GetRootClockFreq (kCLOCK_Root_Flexspi2);
					break;
				default:
					return LibmemStaus_InvalidDevice;
			}
		#else
			#error "unknon controller family"
		#endif
		FLEXSPI_Init (base, &config); // changing the clock requires reinitialization
	}

	// Use the size information from the JEDEC-information to configure the interface
	uint32_t FlashSize = CalculateCapacity_KBytes (info.Capacity);
	deviceconfig.flashSize = FlashSize;
	geometry[0].count = FlashSize / (geometry[0].size / 1024);
	FlashSize *= 1024;	// Convert kBytes to bytes

	FLEXSPI_SetFlashConfig (base, &deviceconfig, FlexSPI_Helper::port);	// Configure flash settings according to serial flash feature.
	FLEXSPI_SoftwareReset (base);

