Masmiseim36/iMXRT/targets/iMXRT/Loader2/libmem_driver_FlexSPI.cpp
	static uint8_t writeBuffer[HYPERFLASH_PAGE_SIZE];
	LibmemDriver *FlashHandle = LibmemDriver::GetDriver ();
//	libmem_register_driver (FlashHandle, GetBaseAddress(base), FlashSize, &geometry[0], nullptr, &DriverFunctions, &DriverFunctions_Extended);
	libmem_register_driver (FlashHandle, base->GetAmbaAddress (), FlashSize, &geometry[0], nullptr, pDriverFunctions, nullptr);
	int err = libmem_driver_paged_write_init (&FlashHandle->PageWriteControlBlock, &writeBuffer[0], GetPageSize (memType), ProgramPage, 4, 0);
	FlashHandle->user_data = reinterpret_cast<uint32_t>(base);

	uint8_t *AliasAddress = base->GetAliasBaseAddress ();
	if (AliasAddress != nullptr && err == LIBMEM_STATUS_SUCCESS)
	{
		FlashHandle = LibmemDriver::GetDriver ();
		libmem_register_driver (FlashHandle, AliasAddress, FlashSize, &geometry[0], nullptr, pDriverFunctions, nullptr);
		err = libmem_driver_paged_write_init (&FlashHandle->PageWriteControlBlock, &writeBuffer[0], GetPageSize (memType), ProgramPage, 4, 0);
		FlashHandle->user_data = reinterpret_cast<uint32_t>(base);
		DebugPrint ("### Add Driver for Alias\r\n");
	}
	return static_cast<LibmemStatus_t>(err);
}


namespace Xspi
{
	namespace
	{
		/*! EraseChip:
		\brief Erase the whole-Flash-memory
		\param base The FlexSPI-Interface where the Flash is located which should be erased
		\return static status_t Status of the Operation - kStatus_Success when successfully */
		[[maybe_unused]] status_t EraseChip (FlexSPI_Helper *base)
		{
			DebugPrint ("EraseChip\r\n");

			status_t stat = base->WriteEnable (0);
			if (stat != kStatus_Success)
				return stat;

			stat = base->SendCommand (0, LUT_EraseChip);
			if (stat != kStatus_Success)
				return LIBMEM_STATUS_ERROR;

			return base->WaitBusBusy ();
		}

		/*! EraseSector:
		\brief Erase a sector of the Flash-Memory
		\param h Handle to the Flash-Driver
		\param si Information about the sector which should be erased
		\return static int LibmemStaus_Success when the erase operation was successfully, otherwise LibmemStaus_Error */
		int EraseSector (libmem_driver_handle_t *h, libmem_sector_info_t *si)
		{
			if (IsSectorEmpty (reinterpret_cast<uint32_t *>(si->start)))
			{
				DebugPrintf ("EraseSector at 0x%x, is allready erased\r\n", si->start);
				return LIBMEM_STATUS_SUCCESS;
			}

			auto *base = reinterpret_cast<FlexSPI_Helper *>(h->user_data);
			const uint32_t sectorAddr = libmem_CalculateOffset (h, si->start);
			if (sectorAddr == UINT32_MAX)
				return LibmemStaus_Error;

			DebugPrintf ("EraseSector at 0x%x, size: %d\r\n", sectorAddr, si->size);

			status_t status = base->WriteEnable (sectorAddr);
			if (status != kStatus_Success)
				return LibmemStaus_Error;

			status = base->SendCommand (sectorAddr, LUT_EraseSector);
			if (status != kStatus_Success)
				return LibmemStaus_Error;

			status = base->WaitBusBusy ();
			if (status != kStatus_Success)
				return LibmemStaus_Error;

			return LibmemStaus_Success;
		}

		/*! ProgramPage:
		\brief Write Data to a Flash-Page
		\param h Handle to the Flash-Driver
		\param destination Address to write the Data to. This Address is in the Address-Range of the Controller
		\param source Address of the Array with the data to write
		\return static int LibmemStaus_Success when the write operation was successfully, otherwise LibmemStaus_Error */
		int ProgramPage (libmem_driver_handle_t *h, uint8_t *destination, const uint8_t *source)
		{
			auto *base = reinterpret_cast<FlexSPI_Helper *>(h->user_data);
			const uint32_t deviceAddress = libmem_CalculateOffset (h, destination);
			if (deviceAddress == UINT32_MAX)
				return LibmemStaus_Error;

			DebugPrintf ("ProgramPage at 0x%08X (Offset:0x%X)\r\n", destination, deviceAddress);

			// Write enable
			status_t status = base->WriteEnable (deviceAddress);
			if (status != kStatus_Success)
				return LibmemStaus_Error;

			// Prepare page program command
			flexspi_transfer_t flashXfer
			{
				deviceAddress,				// deviceAddress	- Operation device address.
				FlexSPI_Helper::port,		// port				- Operation port
				kFLEXSPI_Write,				// cmdType			- Execution command type.
				LUT_ProgramPage,			// seqIndex			- Sequence ID for command.
				1,							// SeqNumber		- Sequence number for command.
				(uint32_t *)source,			// data				- Data buffer.
				QSPIFLASH_PAGE_SIZE			// dataSize			- Data size in bytes.
			};
			status = FLEXSPI_TransferBlocking (base, &flashXfer);
			if (status != kStatus_Success)
				return LibmemStaus_Error;

			status = base->WaitBusBusy ();
			if (status != kStatus_Success)
				return LibmemStaus_Error;

			// Do software reset or clear AHB buffer directly depending on the device capabilities
			#if defined(FSL_FEATURE_SOC_OTFAD_COUNT) && defined(FLEXSPI_AHBCR_CLRAHBRXBUF_MASK) && defined(FLEXSPI_AHBCR_CLRAHBTXBUF_MASK)
				base->AHBCR |= FLEXSPI_AHBCR_CLRAHBRXBUF_MASK | FLEXSPI_AHBCR_CLRAHBTXBUF_MASK;
				base->AHBCR &= ~(FLEXSPI_AHBCR_CLRAHBRXBUF_MASK | FLEXSPI_AHBCR_CLRAHBTXBUF_MASK);
			#else
				FLEXSPI_SoftwareReset (base);
			#endif
			return LibmemStaus_Success;
		}

		/*! libmem_ProgramPage:
		\brief The LIBMEM driver's write function.
		\param h    A pointer to the handle of the LIBMEM driver.
		\param dest A pointer to the memory address in memory range handled by driver to write data to.
		\param src  pointer to the memory address to read data from.
		\param size The number of bytes to write.
		\return int The LIBMEM status result */
		int libmem_ProgramPage (libmem_driver_handle_t *h, uint8_t *dest, const uint8_t *src, size_t size)
		{
			DebugPrintf ("libmem_ProgramPage at 0x%08X - size: %d\r\n", dest, size);
			auto *driver = static_cast<LibmemDriver *>(h);
			return libmem_driver_paged_write (h, dest, src, size, &driver->PageWriteControlBlock);
		}

		/*! libmem_EraseSector:
		\brief The LIBMEM driver's erase function
		\param h           A pointer to the handle of the LIBMEM driver.
		\param start       A pointer to the initial memory address in memory range handled by driver to erase.
		\param size        The number of bytes to erase.
		\param erase_start A pointer to a location in memory to store a pointer to the start of the memory range that has actually been erased or nullptr if not required.
		\param erase_size  A pointer to a location in memory to store the size in bytes of the memory range that has actually been erased or nullptr if not required.
		\return int        The LIBMEM status result */
		int libmem_EraseSector (libmem_driver_handle_t *h, uint8_t *start, size_t size, uint8_t **erase_start, size_t *erase_size)
		{
			DebugPrintf ("libmem_EraseSector at 0x%08X - size: %d\r\n", start, size);
			const int ret = libmem_foreach_sector_in_range (h, start, size, EraseSector, erase_start, erase_size);

			auto *base = reinterpret_cast<FlexSPI_Helper *>(h->user_data);
			FLEXSPI_SoftwareReset (base);

			return ret;
		}

