Masmiseim36/iMXRT/targets/iMXRT/Loader2/libmem_driver_FlexSPI.cpp
		/*! libmem_Flush:
		\brief The LIBMEM driver's flush function.
		\param h    A pointer to the handle of the LIBMEM driver. 
		\return int The LIBMEM status result */
		int libmem_Flush (libmem_driver_handle_t *h)
		{
			DebugPrint ("libmem_Flush\r\n");
			auto *driver = static_cast<LibmemDriver *>(h);
			return libmem_driver_paged_write_flush (h, &driver->PageWriteControlBlock);
		}

		/*! libmem_Read:
		\brief The LIBMEM driver's read extended function.
		\param h    A pointer to the handle of the LIBMEM driver.
		\param dest A pointer to the initial memory address to write data to.
		\param src  A pointer to the initial memory address in the memory range handled by the driver to read data from.
		\param size The number of bytes to write.
		\return int The LIBMEM status result */
		int libmem_Read (libmem_driver_handle_t *h, uint8_t *dest, const uint8_t *src, size_t size)
		{
			DebugPrintf ("Read at 0x%x, size: %d\r\n", src, size);
			if (size == 0)
				return LibmemStaus_InvalidParameter;
//			memcpy (dest, src, size);

			flexspi_transfer_t flashXfer
			{
				(uint32_t)src,		  // Operation device address.
				FlexSPI_Helper::port, // Operation port.
				kFLEXSPI_Read,		  // Execution command type.
				LUT_ReadArray,		  // Sequence ID for command.
				1,					  // Sequence number for command.
				(uint32_t *)dest,	  // Data buffer.
				size				  // Data size in bytes.
			};

			auto *base = reinterpret_cast<FlexSPI_Helper *>(h->user_data);
			const status_t status = FLEXSPI_TransferBlocking (base, &flashXfer);
			if (status != kStatus_Success)
				return status;

			return LibmemStaus_Success;
		}


		/*! libmem_CRC32:
		\brief The LIBMEM driver's crc32 extended function.
		\param h     A pointer to the handle of the LIBMEM driver.
		\param start A pointer to the start of the address range.
		\param size  The size of the address range in bytes.
		\param crc   The initial CRC-32 value.
		\return uint32_t The computed CRC-32 value. */
		uint32_t libmem_CRC32 ([[maybe_unused]]libmem_driver_handle_t *h, const uint8_t *start, size_t size, uint32_t crc)
		{
			DebugPrintf ("Calculate CRC from 0x%X, size 0x%X, calculated CRC: 0x%X\r\n", start, size, crc);
			static std::array <uint8_t, 4096> pageBuffer;

			while (size >= pageBuffer.size())
			{
				libmem_Read (h, pageBuffer.data(), const_cast<uint8_t *>(start), pageBuffer.size());
				crc = libmem_crc32_direct (pageBuffer.data(),  pageBuffer.size(), crc);
				start += pageBuffer.size();
				size  -= pageBuffer.size();
			}
			if (size > 0)
			{
				libmem_Read (h, pageBuffer.data(), const_cast<uint8_t *>(start), pageBuffer.size());
				crc = libmem_crc32_direct (pageBuffer.data(), size, crc);
			}
			return crc;
		}
	} // namespace
} // namespace Xspi

namespace Hyperflash
{
	namespace
	{
		/*! WriteEnable:
		\brief Send write-enable command
		\param base The Flex-SPI-base to use
		\param baseAddr The base-address of the command
		\return status_t kStatus_Success if the operation was successfully */
		status_t WriteEnable (FlexSPI_Helper *base, uint32_t baseAddr)
		{
			return base->SendCommand (baseAddr, static_cast<LUT_CommandOffsets>(Spansion::Command::WriteEnable), 2);
		}

		/*! WaitBusBusy:
		\brief Wait until the Write/erase operation is finished and the Flash is not busy anymore
		\param base The Flex-SPI-base to use
		\return status_t kStatus_Success if the operation was successfully */
		status_t WaitBusBusy (FlexSPI_Helper *base)
		{
			// Wait status ready.
			bool isBusy{false};
			uint32_t readValue{};
			status_t status{};
			flexspi_transfer_t flashXfer
			{
				0,														// deviceAddress	- Operation device address.
				FlexSPI_Helper::port,									// port				- Operation port
				kFLEXSPI_Read,											// cmdType			- Execution command type.
				static_cast<uint8_t>(Spansion::Command::ReadStatus),	// seqIndex			- Sequence ID for command.
				2,														// SeqNumber		- Sequence number for command.
				&readValue,												// data				- Data buffer.
				2														// dataSize			- Data size in bytes.
			};

			do
			{
				status = FLEXSPI_TransferBlocking (base, &flashXfer);
				if (status != kStatus_Success)
					return status;

				isBusy = !(readValue & 0x8000U);

				if (readValue & 0x3200U)
				{
					status = kStatus_Fail;
					break;
				}
			}
			while (isBusy);

			return status;
		}

		/*! EraseChip:
		\brief Erase the whole-Flash-memory
		\param base The FlexSPI-Interface where the Flash is located which should be erased
		\return static status_t Status of the Operation - kStatus_Success when successfully */
		[[maybe_unused]] status_t EraseChip (FlexSPI_Helper *base)
		{
			DebugPrintf ("EraseChip\r\n");

			status_t stat = WriteEnable (base, 0);
			if (stat != kStatus_Success)
				return stat;

			stat = base->SendCommand (0, static_cast<LUT_CommandOffsets>(Spansion::Command::EraseChip), 4);
			if (stat != kStatus_Success)
				return LIBMEM_STATUS_ERROR;

			return WaitBusBusy (base);
		}

		/*! EraseSector:
		\brief Erase a sector of the Flash-Memory
		\param h Handle to the Flash-Driver
		\param si Information about the sector which should be erased
		\return static int LIBMEM_STATUS_SUCCESS when the erase operation was successfully, otherwise LIBMEM_STATUS_ERROR */
		status_t EraseSector (libmem_driver_handle_t *h, libmem_sector_info_t *si)
		{
			static constexpr uint32_t SectorSize = 256 * 1024;
			if (IsSectorEmpty (reinterpret_cast<uint32_t *>(si->start), SectorSize))
			{
				DebugPrintf ("EraseSector at 0x%08X, is allready erased\r\n", si->start);
				return LIBMEM_STATUS_SUCCESS;
			}

			auto *base = reinterpret_cast<FlexSPI_Helper *>(h->user_data);
			const uint32_t sectorAddr = libmem_CalculateOffset (h, si->start);
			if (sectorAddr == UINT32_MAX)
				return LIBMEM_STATUS_INVALID_RANGE;

			DebugPrintf ("EraseSector at 0x%08X, size: %d\r\n", sectorAddr, si->size);

			// Write enable
			status_t status = WriteEnable (base, sectorAddr);
			if (status != kStatus_Success)
				return LIBMEM_STATUS_ERROR;

