Masmiseim36/iMXRT/targets/iMXRT/Loader2/libmem_driver_FlexSPI.cpp
			status = base->SendCommand (sectorAddr, static_cast<LUT_CommandOffsets>(Spansion::Command::EraseSector), 4);
			if (status != kStatus_Success)
				return LibmemStaus_Error;

			status = WaitBusBusy (base);
			if (status != kStatus_Success)
				return LIBMEM_STATUS_ERROR;

			return LIBMEM_STATUS_SUCCESS;
		}

		/*! ProgramPage:
		\brief Write Data to a Flash-Page
		\param h Handle to the Flash-Driver
		\param destination Address to write the Data to. This Address is in the Address-Range of the Controller
		\param source Address of the Array with the Data to write
		\return static int LIBMEM_STATUS_SUCCESS when the write operation was successfully, otherwise LIBMEM_STATUS_ERROR */
		int ProgramPage (libmem_driver_handle_t *h, uint8_t *destination, const uint8_t *source)
		{
			auto *base = reinterpret_cast<FlexSPI_Helper *>(h->user_data);
			const uint32_t deviceAddress = libmem_CalculateOffset (h, destination);
			if (deviceAddress == UINT32_MAX)
				return LIBMEM_STATUS_INVALID_RANGE;

			DebugPrintf ("ProgramPage at 0x%X\r\n", deviceAddress);

			// Write enable
			status_t status = WriteEnable (base, deviceAddress);
			if (status != kStatus_Success)
				return LIBMEM_STATUS_ERROR;

			// Prepare page program command
			flexspi_transfer_t flashXfer
			{
				deviceAddress,											// deviceAddress	- Operation device address.
				FlexSPI_Helper::port,									// port				- Operation port
				kFLEXSPI_Write,											// cmdType			- Execution command type.
				static_cast<uint8_t>(Spansion::Command::PageProgram),	// seqIndex			- Sequence ID for command.
				2,														// SeqNumber		- Sequence number for command.
				const_cast<uint32_t *>(reinterpret_cast<const uint32_t *>(source)),// data				- Data buffer.
				HYPERFLASH_PAGE_SIZE									// dataSize			- Data size in bytes.
			};
			status = FLEXSPI_TransferBlocking (base, &flashXfer);
			if (status != kStatus_Success)
				return LIBMEM_STATUS_ERROR;

			status = WaitBusBusy (base);
			if (status != kStatus_Success)
				return LIBMEM_STATUS_ERROR;

//			// Do software reset or clear AHB buffer directly depending on the device capabilities
//			#if defined(FSL_FEATURE_SOC_OTFAD_COUNT) && defined(FLEXSPI_AHBCR_CLRAHBRXBUF_MASK) && defined(FLEXSPI_AHBCR_CLRAHBTXBUF_MASK)
//				base->AHBCR |= FLEXSPI_AHBCR_CLRAHBRXBUF_MASK | FLEXSPI_AHBCR_CLRAHBTXBUF_MASK;
//				base->AHBCR &= ~(FLEXSPI_AHBCR_CLRAHBRXBUF_MASK | FLEXSPI_AHBCR_CLRAHBTXBUF_MASK);
//			#else
//				FLEXSPI_SoftwareReset (base);
//			#endif
			return LIBMEM_STATUS_SUCCESS;
		}

		/*! libmem_ProgramPage:
		\brief The LIBMEM driver's write function.
		\param h    A pointer to the handle of the LIBMEM driver.
		\param dest A pointer to the memory address in memory range handled by driver to write data to.
		\param src  pointer to the memory address to read data from.
		\param size The number of bytes to write.
		\return int The LIBMEM status result */
		int libmem_ProgramPage (libmem_driver_handle_t *h, uint8_t *dest, const uint8_t *src, size_t size)
		{
			DebugPrintf ("libmem_ProgramPage at 0x%x - size: %d\r\n", dest, size);
			auto *driver = static_cast<LibmemDriver *>(h);
			return libmem_driver_paged_write (h, dest, src, size, &driver->PageWriteControlBlock);
		}

		/*! libmem_EraseSector:
		\brief The LIBMEM driver's erase function
		\param h           A pointer to the handle of the LIBMEM driver.
		\param start       A pointer to the initial memory address in memory range handled by driver to erase.
		\param size        The number of bytes to erase.
		\param erase_start A pointer to a location in memory to store a pointer to the start of the memory range that has actually been erased or nullptr if not required.
		\param erase_size  A pointer to a location in memory to store the size in bytes of the memory range that has actually been erased or nullptr if not required.
		\return int        The LIBMEM status result */
		int libmem_EraseSector (libmem_driver_handle_t *h, uint8_t *start, size_t size, uint8_t **erase_start, size_t *erase_size)
		{
			return libmem_foreach_sector_in_range (h, start, size, EraseSector, erase_start, erase_size);
		}

		/*! libmem_Flush:
		\brief The LIBMEM driver's flush function.
		\param h    A pointer to the handle of the LIBMEM driver. 
		\return int The LIBMEM status result */
		int libmem_Flush (libmem_driver_handle_t *h)
		{
			DebugPrint ("libmem_Flush\r\n");
			auto *driver = static_cast<LibmemDriver *>(h);
			return libmem_driver_paged_write_flush (h, &driver->PageWriteControlBlock);
		}

		/*! libmem_Read:
		\brief The LIBMEM driver's read extended function.
		\param h    A pointer to the handle of the LIBMEM driver.
		\param dest A pointer to the initial memory address to write data to.
		\param src  A pointer to the initial memory address in the memory range handled by the driver to read data from.
		\param size The number of bytes to write.
		\return int The LIBMEM status result */
		int libmem_Read (libmem_driver_handle_t *h, uint8_t *dest, const uint8_t *src, size_t size)
		{
			(void)h;
			if (size != 0)
				memcpy (dest, src, size);
			return LIBMEM_STATUS_SUCCESS;
		}

		/*! libmem_CRC32:
		\brief The LIBMEM driver's crc32 extended function.
		\param h     A pointer to the handle of the LIBMEM driver.
		\param start A pointer to the start of the address range.
		\param size  The size of the address range in bytes.
		\param crc   The initial CRC-32 value.
		\return uint32_t The computed CRC-32 value. */
		uint32_t libmem_CRC32 (libmem_driver_handle_t *h, const uint8_t *start, size_t size, uint32_t crc)
		{
			(void)h;
			crc = libmem_crc32_direct (start, size, crc);
			return crc;
		}
	} // namespace 
} // namesapce Hyperflash